# Cable Type Is Cable Size Usable Method

Source: https://www.revitapidocs.com/2026/8488b8a0-1bf8-bf15-9c4f-3326b95d5fd1.htm

---

| Cable Type Is Cable Size Usable Method |
| --- |

Checks whether the Cable Size can be used by this Cable Type or not.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool IsCableSizeUsable(
	ElementId cableSizeId
)
```

```
Public Function IsCableSizeUsable (
	cableSizeId As ElementId
) As Boolean
```

```
public:
bool IsCableSizeUsable(
	ElementId^ cableSizeId
)
```

```
member IsCableSizeUsable :
        cableSizeId : ElementId -> bool
```

#### Parameters

cableSizeId ElementId
:   The Cable Size id.

#### Return Value

Boolean
True if the Cable Size can be used by this Cable Type. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The id is not a Cable Size id. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

CableType Class Autodesk.Revit.DB.Electrical Namespace